{
    "version": "https://jsonfeed.org/version/1",
    "title": "Elliot",
    "description": "",
    "home_page_url": "https://elliottrapp.com",
    "feed_url": "https://elliottrapp.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Elliot Trapp"
    },
    "items": [
        {
            "id": "https://elliottrapp.com/g.html",
            "url": "https://elliottrapp.com/g.html",
            "title": "The Problems an Urbanist Angeleno Dreams Of",
            "summary": "RMTransit just posted The Most Important Transit Project for LA? which covers the opening of the Regional Connector project here&hellip;",
            "content_html": "<figure class=\"post__image post__image--wide\"><img loading=\"lazy\"  src=\"https://elliottrapp.com/media/posts/15/Metro-Expo-Line-1030628181.jpg\" alt=\"Metro Train\" width=\"1280\" height=\"852\" sizes=\"(min-width: 37.5em) 1600px, 80vw\" srcset=\"https://elliottrapp.com/media/posts/15/responsive/Metro-Expo-Line-1030628181-xs.jpg 384w ,https://elliottrapp.com/media/posts/15/responsive/Metro-Expo-Line-1030628181-sm.jpg 600w ,https://elliottrapp.com/media/posts/15/responsive/Metro-Expo-Line-1030628181-md.jpg 768w ,https://elliottrapp.com/media/posts/15/responsive/Metro-Expo-Line-1030628181-lg.jpg 1200w ,https://elliottrapp.com/media/posts/15/responsive/Metro-Expo-Line-1030628181-xl.jpg 1600w\"></figure>\n<p>RMTransit just posted <a href=\"https://www.youtube.com/watch?v=Qu0wIc_3IfE\" target=\"_blank\" rel=\"noopener noreferrer\">The Most Important Transit Project for LA?</a> which covers the opening of the Regional Connector project here in DTLA. As is typical, RMTransit's video is engaging, entertaining, thought-provoking and well produced. The video provides an overview of what the Regional Connector project is, why it's important to the future of transit in LA, as well as some concerns the author has about the project, particularly in relation to LA Metro's capacity for future growth and expansion. On the whole, I think this video does an excellent job covering the Regional Connector project, but it's important to consider what RMTransit posits as the \"bad\" parts of the project. I think if we take a closer look, we'll see how this video helps elucidate that there are actually both good and bad \"problems\" for a transit system to have and why being clear on this difference matters.</p>\n<h1>Capacity and the Regional Connector</h1>\n<p>One of RMTransit's main concerns is that the Regional Connector and LA Metro more broadly isn't future-proofing its development, in that it's not building infrastructure to ensure it can handle a sudden surge of increased capacity. On some levels I share this concern. It's particularly appropriate to raise this in a place like LA where we have such a massive discrepancy between density and the capacity of our public transit system. In Chicago, it probably doesn't make sense for the CTA to plan investments too heavily around the unlikely scenario of a sudden surge in demand. In LA, on the other hand, there is a lot of latent demand that can be tapped into.<br><br>On the other hand, LA is very different. We have a massive population with very <i>very</i> few people utilizing our transit system. It's feasible to expect someday Metro, the city, and the county would get their act together and transit demand would pick up and start to snowball and suddenly we'd have the transit demand of a Portland or Seattle with a transit system that can't meet that demand. In other words, RMTransit is essentially saying that we should build out capacity the right way now, so we don't have to pay to fix them down the road, which is an incredibly common sense position to take. The three brand-new stations that Metro is opening with the Regional Connector are built to serve three-car trains. <em>THREE.</em> In the second largest city in the United States, after spending billions of dollars, what do we have to show for it? Dinky little trains.<br><br>The problem is, just like with induced demand and all things transit, common sense often leads us astray. Having a transit system that is mismatched with a location's demand is a problem, no doubt. But the problem of too large a transit system and not enough demand is not comparable to having too small a transit system and too much demand. These problems are not the inverse of one another and should not be made equivalent in anyway. The difference between these two classes of problems are what I would call \"bad problems\" (too little demand and too much supply) vs. \"good problems\" (too much demand and too little supply).</p>\n<h1>Bad Problems</h1>\n<p>Urbanists are all too familiar with vicious cycles - a phenomenon that can be seen in many systems, where an undesirable design characteristic is unintentionally introduced and leads to a decline in the overall health of the system. A classic example is the funding model for public transit in North America. When ridership decreases, governments often use this as a justification to slash funding for transit, which leads to poorer service, which in turn leads to fewer riders, and so on - creating a vicious cycle that is hard to break. To prevent this from happening, it is important to recognize the danger of these 'death spirals' and take steps to avoid them at all costs. The ultimate goal of large infrastructure projects is and should be to support and encourage virtuous cycles that will benefit the system in the long run.</p>\n<h1>Good Problems</h1>\n<p>What makes vicious cycles so dangerous and virtuous cycles so enticing? Momentum.<br>Imagine an LA where whenever a train pulled into a station it was overflowing with people. Imagine it was difficult to find a seat on the bus. Would these be frustrating scenarios for us on an individual level? Undoubtably. But these would be signals that the transit system is growing, in demand, and needs more investment. It would signal that the system, as a whole, is actually healthy, and provide the momentum a place like LA needs to start taking transit seriously. We need to stop thinking so myopically from such a limited perspective. In a world where I can't find a seat on the A line, it's only a matter of time before that problem resolves itself. All the people who miss and train and can't find a seat will get frustrated and pressure there local governments and municipalities to fix the problem. Every time their employer has an employee who is late because she couldn't catch a train, that employer will remind the city how much it relies on it's public transit. Imagine the pictures! The internet would be inundated by random pictures of a packed full expo line with captions that read \"how am I supposed to ride this!\" or \"build bigger trains!\" - oh what a joyous day that would be! These are the problems an urbanist Angeleno's dreams are made of.</p>",
            "author": {
                "name": "Elliot Trapp"
            },
            "tags": [
            ],
            "date_published": "2023-06-17T11:30:03-07:00",
            "date_modified": "2023-06-17T11:54:37-07:00"
        },
        {
            "id": "https://elliottrapp.com/why-2.html",
            "url": "https://elliottrapp.com/why-2.html",
            "title": "Why",
            "summary": "Aren’t there enough websites on the internet already? Why add another one? Is this really worth my time? I don’t&hellip;",
            "content_html": "<p>Aren’t there enough websites on the internet already? Why add another one? Is this really worth my time? I don’t know, but this is my attempt to answer that nagging questions.</p>\n<h2 id=\"content\">Content</h2>\n<p>My entire life I’ve felt like my mind is racing. I’ve described it as feeling that my inner voice is extremely loud and impossible to calm. So part of the impact of having this loud inner voice is that I’m constantly juggling ideas. I guess I feel that while I’ve had a lot of intense thoughts about myself, my community, society, and so much more, I’ve never had a mode to document these thoughts and ideas. That’s where this project comes in.</p>\n<h2 id=\"purpose\">Purpose</h2>\n<p>I expect this project to serve a few different functions. I expect it to be part journal, part autobiography, part treatise, but mostly I just want it to be a repository of my ideas. I want a record of my thoughts to persist outside of and beyond me.</p>\n<h3 id=\"structure\">Structure</h3>\n<p>When I was originally considering a project like this, I was thinking it might be a book or a collection of essays. I like that format quite a bit. I kept thinking it might be modeled after H. Peter Steeves books, like <a href=\"https://beingandshowtime.com/.\">Being and Showtime</a> </p>\n<p>But one thing I really appreciate about the modern internet is that it breaks down the idea of a static or fixed documents. I’m a big fan of the “wiki” format because I think it reflects the reality that things change. The idea that we write books and say, this is the final product and ship it off to the publisher is a bit strange to me. I know it’s a product of having to actually physically stop writing and send things off to the printers at some point, but does it have value beyond that? Maybe. Maybe what I really want is a blog? A wiki-blog? At this point, I’m really not sure. I’ll return to this idea later. Whatever form this ends up taking, I think it will be useful to flesh it out a bit first, so that I can actually populate a book, collection of essays, blog or whatever, and not just have a blank page.</p>\n<p>As I’ve been thinking about the structure of this thing, I keep coming back to <a href=\"http://www.drewpendergrass.com/\">Drew Pendergrass’ website</a>. I really like his website. It’s the sort of thing I’d like. It just seems like a fun collection of his writings, software, and serves as a means to share it with people. Maybe I should do that? It would be kind of cool if when I wrote some code I was proud of, after putting it on GitHub I could point it out on the blog and talk about it. That might be fun!</p>\n<h3 id=\"thinking\">Thinking</h3>\n<p>I think if I was reading what I wrote above, I’d be thinking something along the lines, “so what? a lot of people have a lot of ideas, why should anyone care about yours?” I’m a pretty unremarkable person on every level. I’m not great athlete or scientist or artisan. I’m a mediocre software engineer at best, and probably a sub-par amateur philosopher. I don’t say that to elicit pity or reassurance from anyone, I just think it’s the sober reality. Honestly, as I grow older I think I’m more and more okay with this reality. What’s the alternative? That I’m some super-star that does everything on their own? If I finish this thing and you read it, I’m sure you’ll come to understand that I really despise that myth. It’s never true. I just think when you really consider them, all great accomplishments in human history were collective.</p>\n<p>So again, why should anyone care? Because I contend that (1) thinking is an important and crucial human activity and (2) some people are better at thinking than others. Yep, I said it. I know saying that some people are better at thinking than others could ruffle some feathers or come off as not politically correct. I don’t mean it as a rejection of the idea of multiple intelligences. In fact, I think saying some people are better at thinking, at least a certain type of thinking, really is premised on the idea of multiple intelligences. Not everyone can be good at everything. But most people are good at something. So to answer the question, humbly, I think I’m pretty good at thinking and want to share some of the thoughts I’ve had with others.</p>\n<h3 id=\"legacy\">Legacy</h3>\n<p>One of the ideas I expect to touch on is my anti-natalist inclinations. It’s probably cliche, but maybe as I get older I’m thinking more about what I’m going to leave behind and since I have no intentions of having any biological progeny, maybe that drive is pushing to me produce a work like this. Maybe this work is my “legacy”, whatever that means. Maybe these are my memoir’s? I’m not really sure I know what that word means. I feel like you need to be president or something in order to justify having whatever memoirs are anyway, so I probably don’t make the cut.</p>\n<h3 id=\"death\">Death</h3>\n<p>Finally, I’m going to die. It might not be soon, but eventually, we all die. I know this isn’t news to anyone reading this but it really is the answer to the question, “why am I writing this thing?”</p>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://elliottrapp.com/media/posts/8/IMG_20230303_112157.jpg\" alt=\"Image description\" width=\"3000\" height=\"4000\"  sizes=\"(min-width: 37.5em) 1600px, 80vw\" srcset=\"https://elliottrapp.com/media/posts/8/responsive/IMG_20230303_112157-xs.jpg 384w ,https://elliottrapp.com/media/posts/8/responsive/IMG_20230303_112157-sm.jpg 600w ,https://elliottrapp.com/media/posts/8/responsive/IMG_20230303_112157-md.jpg 768w ,https://elliottrapp.com/media/posts/8/responsive/IMG_20230303_112157-lg.jpg 1200w ,https://elliottrapp.com/media/posts/8/responsive/IMG_20230303_112157-xl.jpg 1600w\"></figure></p>\n",
            "author": {
                "name": "Elliot Trapp"
            },
            "tags": [
            ],
            "date_published": "2023-06-02T16:48:51-07:00",
            "date_modified": "2023-06-02T17:03:18-07:00"
        }
    ]
}
