{
    "version": "https://jsonfeed.org/version/1",
    "title": "Elliot",
    "description": "",
    "home_page_url": "https://elliottrapp.com",
    "feed_url": "https://elliottrapp.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Elliot Trapp"
    },
    "items": [
        {
            "id": "https://elliottrapp.com/why-2.html",
            "url": "https://elliottrapp.com/why-2.html",
            "title": "Why",
            "summary": "Aren’t there enough websites on the internet already? Why add another one? Is this really worth my time? I don’t&hellip;",
            "content_html": "<p>Aren’t there enough websites on the internet already? Why add another one? Is this really worth my time? I don’t know, but this is my attempt to answer that nagging questions.</p>\n<h2 id=\"content\">Content</h2>\n<p>My entire life I’ve felt like my mind is racing. I’ve described it as feeling that my inner voice is extremely loud and impossible to calm. So part of the impact of having this loud inner voice is that I’m constantly juggling ideas. I guess I feel that while I’ve had a lot of intense thoughts about myself, my community, society, and so much more, I’ve never had a mode to document these thoughts and ideas. That’s where this project comes in.</p>\n<h2 id=\"purpose\">Purpose</h2>\n<p>I expect this project to serve a few different functions. I expect it to be part journal, part autobiography, part treatise, but mostly I just want it to be a repository of my ideas. I want a record of my thoughts to persist outside of and beyond me.</p>\n<h3 id=\"structure\">Structure</h3>\n<p>When I was originally considering a project like this, I was thinking it might be a book or a collection of essays. I like that format quite a bit. I kept thinking it might be modeled after H. Peter Steeves books, like <a href=\"https://beingandshowtime.com/.\">Being and Showtime</a> </p>\n<p>But one thing I really appreciate about the modern internet is that it breaks down the idea of a static or fixed documents. I’m a big fan of the “wiki” format because I think it reflects the reality that things change. The idea that we write books and say, this is the final product and ship it off to the publisher is a bit strange to me. I know it’s a product of having to actually physically stop writing and send things off to the printers at some point, but does it have value beyond that? Maybe. Maybe what I really want is a blog? A wiki-blog? At this point, I’m really not sure. I’ll return to this idea later. Whatever form this ends up taking, I think it will be useful to flesh it out a bit first, so that I can actually populate a book, collection of essays, blog or whatever, and not just have a blank page.</p>\n<p>As I’ve been thinking about the structure of this thing, I keep coming back to <a href=\"http://www.drewpendergrass.com/\">Drew Pendergrass’ website</a>. I really like his website. It’s the sort of thing I’d like. It just seems like a fun collection of his writings, software, and serves as a means to share it with people. Maybe I should do that? It would be kind of cool if when I wrote some code I was proud of, after putting it on GitHub I could point it out on the blog and talk about it. That might be fun!</p>\n<h3 id=\"thinking\">Thinking</h3>\n<p>I think if I was reading what I wrote above, I’d be thinking something along the lines, “so what? a lot of people have a lot of ideas, why should anyone care about yours?” I’m a pretty unremarkable person on every level. I’m not great athlete or scientist or artisan. I’m a mediocre software engineer at best, and probably a sub-par amateur philosopher. I don’t say that to elicit pity or reassurance from anyone, I just think it’s the sober reality. Honestly, as I grow older I think I’m more and more okay with this reality. What’s the alternative? That I’m some super-star that does everything on their own? If I finish this thing and you read it, I’m sure you’ll come to understand that I really despise that myth. It’s never true. I just think when you really consider them, all great accomplishments in human history were collective.</p>\n<p>So again, why should anyone care? Because I contend that (1) thinking is an important and crucial human activity and (2) some people are better at thinking than others. Yep, I said it. I know saying that some people are better at thinking than others could ruffle some feathers or come off as not politically correct. I don’t mean it as a rejection of the idea of multiple intelligences. In fact, I think saying some people are better at thinking, at least a certain type of thinking, really is premised on the idea of multiple intelligences. Not everyone can be good at everything. But most people are good at something. So to answer the question, humbly, I think I’m pretty good at thinking and want to share some of the thoughts I’ve had with others.</p>\n<h3 id=\"legacy\">Legacy</h3>\n<p>One of the ideas I expect to touch on is my anti-natalist inclinations. It’s probably cliche, but maybe as I get older I’m thinking more about what I’m going to leave behind and since I have no intentions of having any biological progeny, maybe that drive is pushing to me produce a work like this. Maybe this work is my “legacy”, whatever that means. Maybe these are my memoir’s? I’m not really sure I know what that word means. I feel like you need to be president or something in order to justify having whatever memoirs are anyway, so I probably don’t make the cut.</p>\n<h3 id=\"death\">Death</h3>\n<p>Finally, I’m going to die. It might not be soon, but eventually, we all die. I know this isn’t news to anyone reading this but it really is the answer to the question, “why am I writing this thing?”</p>\n",
            "author": {
                "name": "Elliot Trapp"
            },
            "tags": [
            ],
            "date_published": "2023-06-02T16:48:51-07:00",
            "date_modified": "2023-06-02T16:49:48-07:00"
        }
    ]
}
